#ifndef __TIMER_H
#define __TIMER_H

/* 引用头文件 *****************************************************************/
#include "stm32f0xx.h"
/* 外部数据类型 ***************************************************************/
typedef struct {   
    uint32_t timer[10];
}StdTimer_n; 

typedef struct {   
    StdTimer_n Timer_n;
    void (*init)(void);
    uint32_t (*getclock)(void);
}StdTimer; 
/* 外部常数宏 *****************************************************************/
/* 外部动作宏 *****************************************************************/
/* 外部变量 *******************************************************************/
void TimerInit(void);
uint32_t TimerGetClock(void);

#endif
/***************************************************************END OF FILE****/
